#字典的基本操作
'''
1、通过赋值添加字典元素；
2、通过setdefault()函数添加。

'''

#1、通过赋值添加字典元素；
'''
dics = {"小张":12345455,"小明":23445654,"小王":12234556}
dics["小赵"] = 23345556
print(dics)

'''
#2、通过setdefault()函数添加。
'''
dics = {"小张":12345455,"小明":23445654,"小王":12234556}
dics.setdefault("小赵",23434543)
print(dics)
'''

#查找字典元素
#1、通过指定键查找对应值；
'''
dics = {"小张":12345455,"小明":23445654,"小王":12234556}
print(dics["小张"])
'''

#2、通过get()函数查找对应的值。
'''
dics = {"小张":12345455,"小明":23445654,"小王":12234556}
value = dics.get("小张")
print(value)
'''
#3.1、判断字典的键是否存在
'''
dics = {"小张":12345455,"小明":23445654,"小王":12234556}
print(dics.keys())
if "小张" in dics.keys():
    print("存在")
else:
    print("不存在")
'''
#3.2、判断字典的值是否存在
'''
dics = {"小张":12345455,"小明":23445654,"小王":12234556}
print(dics.values())
if 12345455 in dics.values():
    print("存在")
else:
    print("不存在")
'''
#修改字典元素
#1、通过赋值修改字典元素；
'''
dics = {"小张":12345455,"小明":23445654,"小王":12234556}
dics["小张"] = 324345
print(dics)

'''

#2、通过update()函数实现对键值对更新
'''
dics = {"小张":12345455,"小明":23445654,"小王":12234556}
up_dic = {"小赵":234354,"小龙":35346}

dics.update(up_dic)
print(dics)
'''
#删除字典中的元素
#1、使用del()函数删除；
'''
dics = {"小张":12345455,"小明":23445654,"小王":12234556}
del(dics["小张"])
print(dics)
'''
#2、使用pop() 函数删除；
'''
dics = {"小张":12345455,"小明":23445654,"小王":12234556}
dics.pop("小张")
print(dics)
'''
#3、使用popitem()函数删除
'''
dics = {"小张":12345455,"小明":23445654,"小王":12234556}
dics.popitem()
print(dics)
'''

#4、使用 clear()函数删除；

dics = {"小张":12345455,"小明":23445654,"小王":12234556}
dics.clear()
print(dics)













































































