#算术运算符
'''
运算符 描述 示例代码 
+ 加  两个对象相加 a+b    结果为30 
- 减  两个对象相减 a-b   结果为-10 
* 乘  两个对象相乘 a*b  结果为200 
/ 除  两个对象相除 a/b  结果为0.5 
% 取模（取余）返回除法的余数 a%b  结果为 10 
** 幂  x**y  返回x的y次方 a**b  结果为a的b次方 
// 取整数，返回商的整数 5//3     结果为1

a = 3
b = 5
print(b//a)
str1 = "我是中国人"
str2 = "我爱中国"
str3 = str1+str2
print(str3)
'''
#赋值运算符
'''
运算符 描述 示例代码 
= 赋值运算符，不是比较符号 num = 12     
+= 加法赋值运算符 a += b  等效于 a = a +b 
-= 减法赋值运算符 a -= b  等效于 a = a -b 
*= 乘法赋值运算符 a *= b  等效于 a = a *b 
/= 除法赋值运算符 a /= b  等效于 a = a /b 
%= 取模（取余）赋值运算符 a %= b  等效于 a = a %b 
**= 幂赋值运算符 a**=b等效于 a = a **b 
//= 取整数运算符 a//=b等效于 a = a //b
'''

a +=10
a += 10



































